{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend files, components, and test mappings.",
  "frontend-file-summaries.txt": "Text file containing brief descriptions of many frontend components and pages.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, base styles, and dark mode variables.",
  "frontend/index.html": "Root HTML file with a mount point and script entry for the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all pages and includes a scroll‑to‑top handler.",
  "frontend/src/components/blocks/AgeGroupSelector.tsx": "Renders selectable age‑group buttons highlighting the active group.",
  "frontend/src/components/blocks/AlternateContactOptions.tsx": "Displays Call and WhatsApp contact cards using soft card variants.",
  "frontend/src/components/blocks/ComparisonTable.tsx": "Two‑column comparison table contrasting traditional education with Rainbowz.",
  "frontend/src/components/blocks/CtaBlock.tsx": "Reusable CTA section with headline, optional subtext, and primary/secondary buttons.",
  "frontend/src/components/blocks/DiagramPanel.tsx": "Panel showing a titled diagram with optional description and caption.",
  "frontend/src/components/blocks/FaqStrip.tsx": "Accordion‑based FAQ list rendering questions and expandable answers.",
  "frontend/src/components/blocks/FeatureGrid.tsx": "Responsive grid rendering FeatureCard items in 2–4 columns.",
  "frontend/src/components/blocks/GeometricAccent.tsx": "Decorative geometric overlay elements for hero or section backgrounds.",
  "frontend/src/components/blocks/TestimonialStrip.tsx": "Shows a three‑column grid of parent testimonials within a styled container.",
  "frontend/src/components/forms/BookDemoForm.tsx": "A demo booking form with validation, state handling, and a success message screen.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing brand info, navigation links, contact CTA, and attribution.",
  "frontend/src/components/layout/Navbar.tsx": "Responsive navbar with active link highlighting, mobile menu, and demo CTA.",
  "frontend/src/components/layout/SiteLayout.tsx": "Overall page layout wrapping content with navbar and footer.",
  "frontend/src/components/media/GeneratedImage.tsx": "Simple wrapper for rendering responsive lazy-loaded images.",
  "frontend/src/components/media/ThinlineIcon.tsx": "Sprite-based icon component selecting positions for various cognitive-skill icons.",
  "frontend/src/components/primitives/Button.tsx": "Wrapper around Shadcn button supporting variants, sizing, and ref forwarding.",
  "frontend/src/components/primitives/Card.tsx": "Card wrapper with variants and a FeatureCard helper for icon-title-description blocks.",
  "frontend/src/components/primitives/Container.tsx": "Layout container applying max-width and padding.",
  "frontend/src/components/primitives/Section.tsx": "Section wrapper with spacing and optional tinted background.",
  "frontend/src/components/primitives/Typography.tsx": "Typography helpers for headings, subheadings, and body text with preset styles.",
  "frontend/src/content/programs.ts": "Defines program age groups with skills and structure plus related FAQ items.",
  "frontend/src/content/siteCopy.ts": "Centralized marketing copy for hero, sections, outcomes, testimonials, and footer.",
  "frontend/src/content/siteNav.ts": "Navigation item definitions for primary site routes.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing an authenticated or anonymous backend actor with query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, including login state and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Placeholder for future React Query backend hooks; currently empty.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes with a structured color palette.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with sections on the company story, philosophy, research principles, and safety standards.",
  "frontend/src/pages/ContactBookDemoPage.tsx": "Displays a demo booking page with a form, location map placeholder, and alternate contact options.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with hero content, feature sections, testimonials, and final CTA using siteCopy data.",
  "frontend/src/pages/OurMethodPage.tsx": "Explains the training system with diagrams, skill descriptions, techniques, and age‑wise development content.",
  "frontend/src/pages/ParentsGuidePage.tsx": "Renders the Parents’ Guide page with hero text, article cards, learning habits, and an FAQ section using shared UI components.",
  "frontend/src/pages/ProgramsPage.tsx": "Displays program details by age group with a selector, skills, weekly structure, CTA, and a program FAQ section.",
  "frontend/src/pages/ResultsOutcomesPage.tsx": "Shows outcomes with a hero, typical improvements grid, and parent story cards using shared components.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugin integrations.",
  "project_state.json": "Describes the project’s state, goals, architecture, required pages, design system notes, and image requirements."
}